Repository: giellalt/corpus-fin
Catalog: prestable/tmx/fin2smn/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=484_lang=finnish.html.tmx
Source language: fin
Languages: smn

source: Olen 27-vuotias nuori mies Ivalosta.
smn: Mun lam 27-ihásâš nuorâalmai Avelist.

source: Olen syntynyt ja asunut koko ikäni Ivalossa.
smn: Lam šoddâm já aassâm ubâ ave Avelist.

source: Peruskoulun jälkeen olin lyhyen aikaa töissä Helsingissä, jonka jälkeen palasin takaisin kotiseudulleni.
smn: Vuáđuškoovlâ maŋa lijjim uánihis ääigi pargoost Helsigist, mon maŋa maccim päikkikuávlusân.

source: Rakennusalalle menin töihin 18-vuotiaana ja huomasin pitäväni alasta.
smn: Huksimsuárgán moonnim paargon 18-ihásâžžân já aiccim, et lijkkuum paargon.

source: Useamman vuoden työskenneltyäni päätin kouluttautua kirvesmieheksi.
smn: Ko lijjim porgâm maŋgâ ive, te meridim škovliittâttâđ šnikkárin.

source: Koulutuksen ohessa rakensin perheellemme, johon kuuluvat avovaimoni Marika ja hänen tyttärensä Milja, talon Keväjärvelle.
smn: Škovlim paaldâst huksejim jieččân perrui táálu Kiđđâjáávrán. Perrui kuleh ávuskyeimi Marika já suu nieidâ Milja.

source: Vapaa-aikani vietän pääasiassa luonnon helmassa kelkkaillen, veneillen ja kalastaen.
smn: Astoäägi viätám iänááš luándust moottorkiälháin vyejimáin, kárbáin jotemáin já kuáláástmáin.

source: Isäni äiti oli kolttasaamelainen.
smn: Ákkum (eeji enni) lâi nuorttâsämmilâš.

source: Saamelaisuus ei ole näkynyt perheemme arjessa, mutta iän myötä minua on alkanut asia kiinnostamaan ja sen vuoksi lähdinkin mukaan saamelaisten asioita hoitamaan.
smn: Sämmilâšvuotâ ij lah oinum mii perruu aargâst, mut ave mield lam tubdâškuáttám mielâkiddiivâšvuođâ áášán já tondiet vuolgim-uv fáárun tipšođ sämmilij aašijd.

source: Tulevaisuudessa toivoisin että harrastuksistani tulisi ammattini vaikka oman yrityksen kautta.
smn: Puátteevuođâst tuáivuččim et puđâlmijnân šodâččij munjin áámmát veikkâ jieččân irâttâs pehti.
